src/cf/Catalogs/эв_ИсточникиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>эв_ИсточникиЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СимволВСписке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/эв_ИсточникиЗаказов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Функция ВернутьСтруктуруАптекиМегаптека(Удалить)
	
	СтруктураОтвета = Новый Структура("list");
	
	list = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МагазиныКонтактнаяИнформация.Значение КАК Значение,
		|	МагазиныКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	МагазиныКонтактнаяИнформация.Тип КАК Тип,
		|	МагазиныКонтактнаяИнформация.Вид КАК Вид,
		|	МагазиныКонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ ВТ_КИ
		|ИЗ
		|	Справочник.Магазины.КонтактнаяИнформация КАК МагазиныКонтактнаяИнформация
		|ГДЕ
		|	МагазиныКонтактнаяИнформация.Ссылка = &Магазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_КИ.Значение КАК Значение,
		|	ВТ_КИ.Тип КАК Тип,
		|	ВТ_КИ.Вид КАК Вид
		|ИЗ
		|	ВТ_КИ КАК ВТ_КИ
		|ГДЕ
		|	ВТ_КИ.Тип = &ТипАдрес
		|	И ВТ_КИ.Вид = &ВидАдрес
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_КИ.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	ВТ_КИ КАК ВТ_КИ
		|ГДЕ
		|	ВТ_КИ.Тип = &ТипТелефон
		|	И ВТ_КИ.Вид = &ВидТелефон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_КИ.АдресЭП КАК АдресЭП
		|ИЗ
		|	ВТ_КИ КАК ВТ_КИ
		|ГДЕ
		|	ВТ_КИ.Тип = &ТипЭП";
	
	Запрос.УстановитьПараметр("Магазин",    Объект.Склад.Магазин);
	Запрос.УстановитьПараметр("ТипАдрес",   Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидАдрес",   Справочники.ВидыКонтактнойИнформации.ФактАдресМагазина);
	Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонМагазина);
	Запрос.УстановитьПараметр("ТипЭП", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Телефон = "";
	ВыборкаТ = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаТ.Следующий() Цикл
	    Телефон = ВыборкаТ.НомерТелефона;
	КонецЦикла;
	АдресЭП = "";
	ВыборкаЭП = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаЭП.Следующий() Цикл
	    АдресЭП = ВыборкаЭП.АдресЭП;
	КонецЦикла;

	Выборка = РезультатЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Выборка.Значение, Выборка.Тип);
		
		Представление = СтруктураАдреса.value;
		Регион        = СтруктураАдреса.areaValue;
		Город         = ?(ПустаяСтрока(СтруктураАдреса.city), СтруктураАдреса.areaValue, СтруктураАдреса.city); 
		
		Адрес = Сред(Представление, СтрНайти(Представление, Город, НаправлениеПоиска.СКонца));
		Адрес = СтрЗаменить(Адрес,Город+",","");
		
		СтруктураАптеки = Новый Структура;
		СтруктураАптеки.Вставить("id",         XMLСтрока(Объект.Склад));
		СтруктураАптеки.Вставить("region",     Регион);
		СтруктураАптеки.Вставить("city",       Город);
		СтруктураАптеки.Вставить("address",    СокрЛП(Адрес));
		СтруктураАптеки.Вставить("brand",      "ЭВАЛАР");
		СтруктураАптеки.Вставить("latitude",   Объект.Широта);
		СтруктураАптеки.Вставить("longitude",  Объект.Долгота);
		СтруктураАптеки.Вставить("phone",      Телефон);
		СтруктураАптеки.Вставить("schedule",   Объект.ГрафикРаботы);
		СтруктураАптеки.Вставить("ogrn",       СокрЛП(Объект.Склад.Организация.ОГРН));
		СтруктураАптеки.Вставить("email",      АдресЭП);
		СтруктураАптеки.Вставить("is_deleted", Удалить);
		
		list.Добавить(СтруктураАптеки);
		
	КонецЦикла;
	
	СтруктураОтвета.list = list;
	
	Возврат СтруктураОтвета;
	
КонецФункции 
&НаСервере
Функция ВернутьСтруктуруАптекиЮтека(Удалить)
	
	СтруктураОтвета = Новый Структура("list");
	
	list = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МагазиныКонтактнаяИнформация.Значение КАК Значение,
		|	МагазиныКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	МагазиныКонтактнаяИнформация.Тип КАК Тип,
		|	МагазиныКонтактнаяИнформация.Вид КАК Вид,
		|	МагазиныКонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ ВТ_КИ
		|ИЗ
		|	Справочник.Магазины.КонтактнаяИнформация КАК МагазиныКонтактнаяИнформация
		|ГДЕ
		|	МагазиныКонтактнаяИнформация.Ссылка = &Магазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_КИ.Значение КАК Значение,
		|	ВТ_КИ.Тип КАК Тип,
		|	ВТ_КИ.Вид КАК Вид
		|ИЗ
		|	ВТ_КИ КАК ВТ_КИ
		|ГДЕ
		|	ВТ_КИ.Тип = &ТипАдрес
		|	И ВТ_КИ.Вид = &ВидАдрес
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_КИ.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	ВТ_КИ КАК ВТ_КИ
		|ГДЕ
		|	ВТ_КИ.Тип = &ТипТелефон
		|	И ВТ_КИ.Вид = &ВидТелефон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_КИ.АдресЭП КАК АдресЭП
		|ИЗ
		|	ВТ_КИ КАК ВТ_КИ
		|ГДЕ
		|	ВТ_КИ.Тип = &ТипЭП";
	
	Запрос.УстановитьПараметр("Магазин",    Объект.Склад.Магазин);
	Запрос.УстановитьПараметр("ТипАдрес",   Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидАдрес",   Справочники.ВидыКонтактнойИнформации.ФактАдресМагазина);
	Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонМагазина);
	Запрос.УстановитьПараметр("ТипЭП", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Телефон = "";
	ВыборкаТ = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаТ.Следующий() Цикл
	    Телефон = ВыборкаТ.НомерТелефона;
	КонецЦикла;
	АдресЭП = "";
	ВыборкаЭП = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаЭП.Следующий() Цикл
	    АдресЭП = ВыборкаЭП.АдресЭП;
	КонецЦикла;

	Выборка = РезультатЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Выборка.Значение, Выборка.Тип);
		
		Представление = СтруктураАдреса.value;
		Регион        = СтруктураАдреса.areaValue;
		Город         = ?(ПустаяСтрока(СтруктураАдреса.city), СтруктураАдреса.areaValue, СтруктураАдреса.city); 
		
		Адрес = Сред(Представление, СтрНайти(Представление, Город, НаправлениеПоиска.СКонца));
		Адрес = СтрЗаменить(Адрес,Город+",","");
		
		СтруктураАптеки = Новый Структура;
		СтруктураАптеки.Вставить("id",         XMLСтрока(Объект.Склад));
		//СтруктураАптеки.Вставить("network_id", XMLСтрока(Объект.Склад.Организация));
		СтруктураАптеки.Вставить("region",     Регион);
		СтруктураАптеки.Вставить("city",       Город);
		СтруктураАптеки.Вставить("address",    СокрЛП(Адрес));
		СтруктураАптеки.Вставить("brand",      "ЭВАЛАР");
		СтруктураАптеки.Вставить("latitude",   Объект.Широта);
		СтруктураАптеки.Вставить("longitude",  Объект.Долгота);
		СтруктураАптеки.Вставить("phone",      Телефон);
		СтруктураАптеки.Вставить("schedule",   Объект.ГрафикРаботы);
		СтруктураАптеки.Вставить("ogrn",       СокрЛП(Объект.Склад.Организация.ОГРН));
		СтруктураАптеки.Вставить("email",      АдресЭП);
		СтруктураАптеки.Вставить("is_deleted", Удалить);
		
		list.Добавить(СтруктураАптеки);
		
	КонецЦикла;
	
	СтруктураОтвета.list = list;
	
	Возврат СтруктураОтвета;
	
КонецФункции 
			  
			  
&НаСервере
Процедура ОтправитьАптекуВСервисМегааптекаНаСервере(Удалить)
	// Вставить содержимое обработчика.  
	
	СтруктураОтвета = эвОбменСПорталамиСобытия.ПолучитьпараметрыПодключенияКПорталу(Объект.Вид, Объект.Активный);
	
	НастройкиВыгрузки = СтруктураОтвета.НастройкиВыгрузки;
	
    Для каждого Источник Из НастройкиВыгрузки Цикл
	
		Если ПустаяСтрока(Источник.Адрес) ИЛИ ПустаяСтрока(Источник.auth_token) ИЛИ ПустаяСтрока(Источник.merchant) Тогда 
			ОбщегоНазначения.СообщитьПользователю("Настройки API не указаны!");
			Продолжить;
		КонецЕсли;

		ЗаголовкиЗапросов = Новый Соответствие;
		ЗаголовкиЗапросов.Вставить("Content-Type", "application/json");
		ЗаголовкиЗапросов.Вставить("merchant-code", Источник.merchant);
		ЗаголовкиЗапросов.Вставить("auth-token",    Источник.auth_token);
		
		СтруктураПакета = ВернутьСтруктуруАптекиМегаптека(Удалить);
		
		Попытка   
			РезультатОбновления = КоннекторHTTP.PostJson(СокрЛП(Источник.Адрес)+"/stores", СтруктураПакета, Новый Структура("Заголовки", ЗаголовкиЗапросов)); 
		Исключение   
			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка отправки статуса Аптеки в %1", Источник.Адрес), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
		
		Если РезультатОбновления.Свойство("message") Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатОбновления.message);
		КонецЕсли;
		
		Если РезультатОбновления.КодСостояния = 200 Тогда 
			ОбщегоНазначения.СообщитьПользователю("Данные в сервисе актуализированы!"); 
			Объект.Активный = Истина;
		Иначе	
			Объект.Активный = Ложь;
			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка отправки статуса Аптеки в %1", Источник.Адрес), УровеньЖурналаРегистрации.Ошибка, , , РезультатОбновления.message);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура ОтправитьАптекуВСервисЮтекаНаСервере(Удалить)
	// Вставить содержимое обработчика.  

	СтруктураОтвета = эвОбменСПорталамиСобытия.ПолучитьпараметрыПодключенияКПорталу(Объект.Вид, Объект.Активный);
	
	НастройкиВыгрузки = СтруктураОтвета.НастройкиВыгрузки;
	
    Для каждого Источник Из НастройкиВыгрузки Цикл
	
		Если ПустаяСтрока(Источник.Адрес) ИЛИ ПустаяСтрока(Источник.auth_token) ИЛИ ПустаяСтрока(Источник.merchant) Тогда 
			ОбщегоНазначения.СообщитьПользователю("Настройки API не указаны!");
			Продолжить;
		КонецЕсли;
		
		ЗаголовкиЗапросов = Новый Соответствие;
		ЗаголовкиЗапросов.Вставить("Content-Type", "application/json");
		ЗаголовкиЗапросов.Вставить("auth_token",    Источник.auth_token);
		
		// Отправим Аптеку
		СтруктураПакета = ВернутьСтруктуруАптекиЮтека(Удалить);
		
		Попытка   
			РезультатОбновления = КоннекторHTTP.PutJson(СокрЛП(Источник.Адрес)+"/stores?mc="+СокрП(Источник.merchant), СтруктураПакета, Новый Структура("Заголовки", ЗаголовкиЗапросов)); 
		Исключение   
			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка отправки Аптеки в %1", Источник.Адрес), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
		
		Если РезультатОбновления.Свойство("message") Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатОбновления.message);
			Возврат;
		КонецЕсли;
		
		Если РезультатОбновления.КодСостояния = 200 Тогда 
			ОбщегоНазначения.СообщитьПользователю("Данные в сервисе актуализированы!"); 
			Объект.Активный = Истина;
		Иначе	
			Объект.Активный = Ложь;
			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка отправки Аптеки в %1", Источник.Адрес), УровеньЖурналаРегистрации.Ошибка);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусАптекиМегааптекаНаСервере()
	// Вставить содержимое обработчика.
	
	СтруктураОтвета = эвОбменСПорталамиСобытия.ПолучитьпараметрыПодключенияКПорталу(Объект.Вид, Объект.Активный);
	
	НастройкиВыгрузки = СтруктураОтвета.НастройкиВыгрузки;
	
	Для каждого Источник Из НастройкиВыгрузки Цикл
	
		Если ПустаяСтрока(Источник.Адрес) ИЛИ ПустаяСтрока(Источник.auth_token) ИЛИ ПустаяСтрока(Источник.merchant) Тогда 
			ОбщегоНазначения.СообщитьПользователю("Настройки API не указаны!");
			Продолжить;
		КонецЕсли;
		
		ЗаголовкиЗапросов = Новый Соответствие;
		ЗаголовкиЗапросов.Вставить("Content-Type", "application/json");
		ЗаголовкиЗапросов.Вставить("merchant-code", Источник.merchant);
		ЗаголовкиЗапросов.Вставить("auth-token",    Источник.auth_token);

		СтруктураПакета = Новый Структура("store_id", XMLСтрока(Объект.Склад));
		
	    Попытка   
			РезультатОбновления = КоннекторHTTP.GETJson(СокрЛП(Источник.Адрес)+"/stores", СтруктураПакета, Новый Структура("Заголовки", ЗаголовкиЗапросов)); 
		Исключение   
			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка получения статуса Аптеки в %1", Источник.Адрес), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
		
		Если РезультатОбновления.КодСостояния = 200 Тогда
			Для каждого Структура Из РезультатОбновления.list Цикл
				МассивСтрок = Новый Массив;
				Для каждого Элемент Из Структура Цикл
					МассивСтрок.Добавить(Элемент.Ключ + " = " + Элемент.Значение);
				КонецЦикла;
				ОбщегоНазначения.СообщитьПользователю(СтрСоединить(МассивСтрок,Символы.ПС));
			КонецЦикла;
		Иначе	
			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка отправки статуса Аптеки в %1", Источник.Адрес), УровеньЖурналаРегистрации.Ошибка, , , РезультатОбновления.message);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьАптекуВСервис(Команда)   
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите склад");
		Возврат;
	КонецЕсли;
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.МегаАптека") Тогда
		ОтправитьАптекуВСервисМегааптекаНаСервере(Ложь);
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.Ютека") Тогда	
		ОтправитьАптекуВСервисЮтекаНаСервере(Ложь);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура УдалитьАптекуИзСервиса(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите склад");
		Возврат;
	КонецЕсли;
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.МегаАптека") Тогда
		ОтправитьАптекуВСервисМегааптекаНаСервере(Истина);
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.Ютека") Тогда	
		ОтправитьАптекуВСервисЮтекаНаСервере(Истина);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьСтатусАптеки(Команда)

	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.МегаАптека") Тогда
		ПроверитьСтатусАптекиМегааптекаНаСервере(); 
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.Ютека") Тогда	
	//	ПроверитьСтатусАптекиЮтекаНаСервере(); 
	КонецЕсли;

КонецПроцедуры




&НаСервере
Процедура ВыполнитьСвязкиАСНАНаСервере()
	// Вставить содержимое обработчика. 
	эвОбменСПорталамиСобытия.эв_ЗагрузитьСвязкиНоменклатурыАСНА();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСвязкиАСНА(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьСвязкиНаКлиенте", ЭтаФорма, Неопределено);
	ТекстВопроса = "Связки загружать спустя не менее чем через 3 часа, после отправки каталога! Продолжжить?";
		 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвязкиНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		 Возврат;
	КонецЕсли;
	
	ВыполнитьСвязкиАСНАНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ОтправитьФайлКаталогаНаСервере(Адрес)
	// Вставить содержимое обработчика.
	
	Возврат эвОбменСПорталамиСобытия.эв_ВыгрузитьКаталогДБФАсна(Адрес);

КонецФункции

&НаКлиенте
Процедура ОтправитьКаталогНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		 Возврат;
	КонецЕсли;
	
	ПутьWinSCP = "C:\Program Files (x86)\WinSCP\WinSCP.exe";

	ФайлФТП = Новый Файл(ПутьWinSCP);
	Если НЕ ФайлФТП.Существует() Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Для отправки каталога необходимо наличие установленной программы WinSCP в каталог %1", ПутьWinSCP));
		Возврат;
	КонецЕсли; 
	
	// В Адрес окажется файл во ВХ
	Адрес = ПоместитьВоВременноеХранилище(, УникальныйИдентификатор);
	
	ПарФТП = ОтправитьФайлКаталогаНаСервере(Адрес);
	
	Если ПарФТП = "" Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю("В источнике заказов Асна не указан склад выгрузки остатков");
		Возврат;
	КонецЕсли; 

	НовоеИмяФайла = ПолучитьИмяВременногоФайла("dbf");
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ДД.Записать(НовоеИмяФайла);
	
	ТекстСценария = СтрШаблон("option batch abort
	|option confirm off
	|open sftp://%1:%2@%3 -hostkey=*
	|put -delete -rawtransfersettings[2] IgnorePermErrors=1 ReplaceInvalidChars=0 %4 \goods.dbf
	|exit", ПарФТП.ЛогинФТП, ПарФТП.ПарольФТП, ПарФТП.АдресФТП, НовоеИмяФайла);
	
	ИмяФайлаСценария = ПолучитьИмяВременногоФайла(".txt");
	ФайлСценария = Новый ТекстовыйДокумент;
	ФайлСценария.УстановитьТекст(ТекстСценария);
	ФайлСценария.Записать(ИмяФайлаСценария);
	
	Лог = ПолучитьИмяВременногоФайла(".log");
	
	Команда = """" + ПутьWinSCP + """ /ini=nul /console /script=""" + ИмяФайлаСценария + """" + " /log=""" + Лог + """"; 
	
	ЗапуститьПриложение(Команда,,Истина);
	
	ФайлЛог= Новый ТекстовыйДокумент;
	Попытка
		ФайлЛог.Прочитать(Лог, КодировкаТекста.UTF8);
	Исключение
	    ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ФайлЛог.Показать("Лог выгрузки файла на SFTP сервер портала", ФайлЛог);
	
	Объект.Комментарий = СтрШаблон("Отправка каталога %1", ТекущаяДата());
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФайлКаталога(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОтправитьКаталогНаКлиенте", ЭтаФорма, Неопределено);
	ТекстВопроса = "Каталог выгужать не чаще 1 раза в неделю! Продолжжить?";
		 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  

КонецПроцедуры

&НаСервере
Процедура ПолнаяВыгрузкаОстатковНаСервере()
	// Вставить содержимое обработчика.
	
	Если Объект.Вид = Перечисления.эвВидыИсточниковЗаказа.МегаАптека Тогда
		эвОбменСПорталамиСобытия.ВыгрузитьОстаткиЦеныНаПортал(Перечисления.эвВидыИсточниковЗаказа.МегаАптека, "эв_СвободныеОстаткиДляПорталаМегааптека", Истина);	
	ИНачеЕсли Объект.Вид = Перечисления.эвВидыИсточниковЗаказа.Ютека Тогда
		эвОбменСПорталамиСобытия.ВыгрузитьОстаткиЦеныНаПортал(Перечисления.эвВидыИсточниковЗаказа.Ютека,      "эв_СвободныеОстаткиДляПорталаЮтека",      Истина);	
	ИНачеЕсли Объект.Вид = Перечисления.эвВидыИсточниковЗаказа.Асна Тогда
		эвОбменСПорталамиСобытия.эв_ВыгрузитьОстаткиЦеныНаПорталАсна(Истина);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолнаяВыгрузкаОстатков(Команда)
	ПолнаяВыгрузкаОстатковНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()

	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.МегаАптека") Тогда
	    Элементы.ОтправитьАптекуВСервис.Видимость = Истина;
	    Элементы.ПроверитьСтатусАптеки.Видимость  = Истина;
	    Элементы.УдалитьАптекуИзСервиса.Видимость = Истина;
	    Элементы.ВыполнитьСвязкиАСНА.Видимость    = Ложь;
	    Элементы.ОтправитьФайлКаталога.Видимость  = Ложь;
	    Элементы.ПолнаяВыгрузкаОстатков.Видимость = Истина;
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.Ютека") Тогда
	    Элементы.ОтправитьАптекуВСервис.Видимость = Истина;
	    Элементы.ПроверитьСтатусАптеки.Видимость  = Ложь;
	    Элементы.УдалитьАптекуИзСервиса.Видимость = Истина;
	    Элементы.ВыполнитьСвязкиАСНА.Видимость    = Ложь;
	    Элементы.ОтправитьФайлКаталога.Видимость  = Ложь;
	    Элементы.ПолнаяВыгрузкаОстатков.Видимость = Истина;
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.эвВидыИсточниковЗаказа.Асна") Тогда
	    Элементы.ОтправитьАптекуВСервис.Видимость = Ложь;
	    Элементы.ПроверитьСтатусАптеки.Видимость  = Ложь;
	    Элементы.УдалитьАптекуИзСервиса.Видимость = Ложь;
	    Элементы.ВыполнитьСвязкиАСНА.Видимость    = Истина;
	    Элементы.ОтправитьФайлКаталога.Видимость  = Истина;
	    Элементы.ПолнаяВыгрузкаОстатков.Видимость = Истина; 
	ИНаче
		Элементы.ОтправитьАптекуВСервис.Видимость = Ложь;
	    Элементы.ПроверитьСтатусАптеки.Видимость  = Ложь;
	    Элементы.УдалитьАптекуИзСервиса.Видимость = Ложь;
	    Элементы.ВыполнитьСвязкиАСНА.Видимость    = Ложь;
	    Элементы.ОтправитьФайлКаталога.Видимость  = Ложь;
	    Элементы.ПолнаяВыгрузкаОстатков.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	 УстановитьВидимость();
КонецПроцедуры
